Creating DataFrames

In [1]:
import pandas as pd

In [2]:
#using list
data = [["Alice",25],
        ["Bob",30],
        ["Charlie",35]
       ]

df = pd.DataFrame(data, columns=["Name","Age"])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
#using dictionary
data1 = {"a":[1,2,3,4],
         "b":[5,6,7,8],
         "c":[11,12,13,14]
        }

data1

{'a': [1, 2, 3, 4], 'b': [5, 6, 7, 8], 'c': [11, 12, 13, 14]}

In [4]:
df1 = pd.DataFrame(data1)

In [5]:
df1

   a  b   c
0  1  5  11
1  2  6  12
2  3  7  13
3  4  8  14

In [6]:
# using numpy array
import numpy as np

In [7]:
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])

In [8]:
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
df2 = pd.DataFrame(arr, columns=["A","B","C"])

In [10]:
df2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
# reading excel file using pandas
df2 = pd.read_excel("data.xlsx")
df2

      Name  school  marks
0  Shubham     SPS     34
1   Joshua     UPS     45
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [14]:
# reading csv file
df3 = pd.read_csv("data.csv")

In [15]:
df3

      Name  school  marks
0  Shubham     SPS     34
1   Joshua     UPS     45
2     Jack     WPS     56
3     Alex     ULS     67
4  Jasmine     RTS     78
5    Rohan     RRY     89
6    Rishi  Luxury     90
7   Aakash     BBL     79

In [18]:
# reading json file
df4 = pd.read_json("data.json")

In [19]:
df4

      name         lan
0  ajinkya      pyhton
1     jack  javascript

In [22]:
# dataset url reading
df5 = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [23]:
df5

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

EDA (Exploratory Data Analysis)
Exploratory Data Analysis (EDA) is an essential first step in any data science project.

It involves taking a deep look at the dataset to understand its structure, spot patterns, identify anomalies, and uncover relationships between variables. This process includes generating summary statistics, checking for missing or duplicate data, and creating visualizations like histograms, box plots, and scatter plots. The goal of EDA is to get a clear picture of what the data is telling you before applying any analysis or machine learning models.

By exploring the data thoroughly, you can make better decisions about how to clean, transform, and model it effectively.

In [24]:
# first 5 rows
df5.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [25]:
# last 5 rows
df5.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [26]:
#info dataset
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [27]:
# stats
df5.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [29]:
# list of column names
df5.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [31]:
#shape (r,c)
df5.shape

(244, 7)